{
  "metadata": {
    "dateLocale": "en-US",
    "ideographicComma": ", "
  },
  "java": "Java Edition",
  "bedrock": "Bedrock Edition",
  "appbar": {
    "title": "Memified Chinese · Web Builder",
    "mcbbs": "MCBBS",
    "github": "GitHub",
    "discPack": "Disc Pack",
    "nightModeSwitch": "Day/Night Mode",
    "languages": "Languages"
  },
  "form": {
    "fetchListFailed": {
      "headline": "Error",
      "text": "An error occurred while requesting module list to the server.",
      "retry": "Retry",
      "feedback": "Submit feedback",
      "ignore": "Ignore"
    },
    "version": {
      "helper": "Please select the period where your game version falls in.",
      "label": "Game version",
      "captions": {
        "release": "Latest Release",
        "snapshot": "Latest Snapshot",
        "compatible": "With Compatible Option",
        "legacy": "Versions below 1.11 not supported"
      }
    },
    "resource": {
      "helper": "Please select add-on modules you need.",
      "label": "Add-on modules"
    },
    "language": {
      "helper": "Please select old/special version-specific strings.",
      "label": "Language modules"
    },
    "mod": {
      "helper": "Please select Mods to be included.",
      "label": "Mods",
      "header": "Mod files",
      "enHeader": "Mod files (not translated to Chinese)"
    },
    "beExtType": {
      "helper": "Please select the file format you prefer for the pack.",
      "label": "File format"
    },
    "compatible": {
      "helper": "Make the pack compatible with language files in other packs. This option will overwrite Memified Chinese onto Simplified Chinese, thus you only need to select \"Simplified Chinese\" in the language menu. Learn more at README.md.",
      "label": "Compatible option",
      "disabled": "You are playing game version older than 1.13, thus this is forced to set to on."
    },
    "submit": "Submit build options",
    "clearSelected": "Clear selected",
    "clearAll": "Clear all",
    "author": "Author: ",
    "item": "item(s)",
    "collections": {
      "helper": "Please select Add-on module collections, cherry-picked by our team.",
      "label": "Module collections",
      "description_prefix": "Total ",
      "resource_suffix": " resource modules"
    },
    "incompatible": "(incompatible with {{i}})",
    "modified": "Last Modified at ",
    "modOption": {
      "all": "All",
      "none": "None",
      "custom": "Custom"
    },
    "child": {
      "label": "Child Mode",
      "ticks": [
        "12+",
        "16+",
        "18+"
      ],
      "helpers": [
        "For children with immature mentality. Extra protected and censored. Recommended for streaming and recording.",
        "For teenagers. Only political and especially suggestive contents are censored. Suitable for streaming and recording.",
        "For fully grown adult minds. NO censoring at all. We DO NOT recommended this for streaming and recording."
      ]
    },
    "bedrockHint": {
      "text": "We assume that you are using the latest Minecraft version. Read more at ",
      "readme": "README.md",
      "end": " in the GitHub repo."
    },
    "search": "Type to search",
    "idk": "If you don't know how to use the advanced build options, feel free to click the submit button and download the pack straight away."
  },
  "helpers": [
    "Don't know how to choose those options? Just click the button below.",
    "If you need the links to MCBBS/GitHub/Disc pack for Bedrock, you can click the Bedrock tab before clicking the buttons.",
    "You can report issues to us by clicking the ¿ on the right corner.",
    "We are switching to a new build server. If you find a problem, you can switch the server in the appbar and create an issue.",
    "Memified Chinese is an active project. Please check back often."
  ],
  "log": {
    "buildSuccess": "Success",
    "buildError": "Error",
    "headline": "Build log",
    "download": "Download",
    "share": "Share",
    "feedback": "Feedback",
    "clipboard": "Copied to clipboard, link is valid in 7 days",
    "ad": {
      "title": "Don't click the button just yet. We need your support today.",
      "dismiss": "No, thanks. I don't care and I just want to see the download.",
      "dismissSnackbar": "Sorry for the inconvenience and shameless moral coercion! We have disabled this prompt until your next session. However, we really need your help. If you changed your mind, you can always press the Donate button. Thanks!",
      "firstTime": "This might be a bit awkward, but please don't scroll away. Today we humbly ask for your help in order for us to better create. We never any ads on the website, but it needs ￥5 to survive every day. This fund has been paid by members of the Studio since Day 1. However, among the thousands who use this pack, only 15‰ or the people bas actually donate and supported us (this is the real number). If you can donate ￥10 today, we will work harder than ever, and you will be shouted out on out bilibili post. If our pack has ever brought you ￥10 worth of fun and laughter, please give us some support now. Thank you.",
      "reconsider": "Hey! Nice to see ya! We are asking you for help again. You may not like it, but we need your help. If you are still hesitating, we want you pull out some info: We never any ads on the website, but it needs ￥5 to survive every day. This fund has been paid by members of the Studio since Day 1. However, among the thousands who use this pack, only 15‰ or the people bas actually donate and supported us (this is the real number). If you can donate ￥10 today, we will work harder than ever, and you will be shouted out on out bilibili post. If our pack has ever brought you ￥10 worth of fun and laughter, please give us some support now. Thank you.",
      "renew": "Thanks for your previous support! Even if you just clicked the link to have a look, but thank you anyway. It really helps us A LOT! Although this is kinda shameless, but it's been a while since your previous donation. If you want to keep supporting our creation, please click the Donate button. Nope? All right, no problem! Thank you.",
      "donationNotice": "Please do not make a donation unless you are an adult or with parental advisory. We recommend you to only make a donation if you are economic independent. Full refund available in 7 days after donation (transaction fee not included). Partial refund available in 30 days after donation. Supports Alipay and WeChat Pay. Your transaction will be processed by afdian.net and afidian.net terms apply. 6% transaction fee is needed and will be deducted from your donation.",
      "donateSnackbar": "Thanks for your donation!"
    },
    "howToInstall": "How to install?",
    "followUpdates": "The pack updates quickly! We recommend you to update the pack after some time. You can also follow our <1>Bilibili page</1> for updates."
  },
  "sponsor": {
    "overline": "Sponsors",
    "quoteAd": {
      "subtitle": "A word from our sponsor",
      "none": "Hmm, nothing here. This is the sponsor message spot. We accept any message except commercial ads. Leave a message?",
      "author": "Dianliang233",
      "commercialWarning": "Any message that tries to promote a commercial product or service will be ignored and the donation will not be refundable."
    },
    "thankYou": "Thank you for your support! Your donation enabled us create better work and really helps us A LOT.",
    "roll": "Roll it!"
  },
  "snackbar": {
    "close": "Close",
    "feedback": "Feedback",
    "buildSuccess": "Build succeeded.",
    "buildError": "Build failed.",
    "shareLinkParsed": "Successfully parsed share link.",
    "shareCopyedToClipboard": "Link copied to clipboard."
  },
  "dialog": {
    "help": {
      "title": "Help & About",
      "?": "¿Any questions?",
      "thinkTwice": "Think twice before submitting any issues!",
      "thinkList": {
        "1": "Have you read the helpers below every option?",
        "2": "Have you read the helpers above the download button?",
        "3": "Have you tried to troubleshoot your game and Mods?"
      },
      "sure": "If you are sure that Memified Chinese have problems, you can report them to us. Suggestions are welcomed too!",
      "needToKnow": "You are acknowledged that:",
      "needToKnowList": {
        "1": "According to the license, the developers don't have to address every single issue.",
        "2": "Please make sure that your issues haven't been submitted by someone else.",
        "3": "Please use Mandarin Chinese or English.",
        "4": "Too many spam issues may cause you to be banned.",
        "5": "Submit issues in the accordingly project. Especially, do not submit in-game content or problem to \"Web Builder\", it is only for failed builds or problems with the web interface."
      },
      "ready": "All right! Ready for submitting?",
      "webBuilder": "Web Builder",
      "dev": {
        "title": "Devs",
        "lcnb": {
          "name": "_LittleC_",
          "des": "Memepack Builder - Core dev; Web Builder - Core dev"
        },
        "cat": {
          "name": "MysticNebula70",
          "des": "Memepack Builder - Core dev; Web Builder - Backend core dev"
        },
        "lake": {
          "name": "LakeJason",
          "des": "Memepack Builder - Early dev; Web Builder - Early core dev"
        },
        "dll": {
          "name": "Dianliang233",
          "des": "Web Builder - Frontend dev"
        }
      },
      "poweredBy": "Powered by…"
    }
  },
  "footer": {
    "slogan": "Built with ❤️ ️love, 🔮 fantasies, 🐝 bees and 🤣 memes.",
    "terms": "Terms",
    "privacy": "Privacy",
    "donate": "Donate"
  },
  "skipToForm": "Skip to form"
}
